examples/prelim0/openfoam/square_cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 0   0 0)
    (30   0 0)
    (30  30 0)
    ( 0  30 0)
    ( 0   0 1)
    (30   0 1)
    (30  30 1)
    ( 0  30 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
    topAndBottom
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
        );
    }
    hot
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    cold
    {
        type wall;
        faces
        (
            (6 2 1 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
