examples/prelim0/openfoam/square_cavity/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    topAndBottom
    {
        type            kLowReWallFunction;
        value           uniform 0.015;
    }

    hot
    {
        type            kLowReWallFunction;
        value           uniform 0.015;
    }

    cold
    {
        type            kLowReWallFunction;
        value           uniform 0.015;
    }
}


// ************************************************************************* //
